w5d4/DogeBird/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # params hash sent from front end
        # @exposes variable to the view
        @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        # debugger
        incoming_id = params[:id]
        @user = User.find_by(id: incoming_id)

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "age", "favorite_coin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "Taylor Swift"], ["email", "tswift@gmail.com"], ["created_at", "2022-07-20 19:05:51.344824"], ["updated_at", "2022-07-20 19:05:51.344824"], ["age", 25], ["favorite_coin", "Bitcoin"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "favorite_coin" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-20 19:13:55.950692"], ["favorite_coin", "Eth baby"], ["id", 4]]
---
    def update
        @user = User.find_by(id: params[:id])
        if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
    def destroy
        @user = User.find_by(id: params[:id])
       if @user.destroy